#+PROPERTY: header-args+ :var  DATA_SHEET_DIR="/home/jj/work/data-sheets/omat"
#+latex_compiler: pdflatex
#+LATEX_HEADER_EXTRA: \usepackage{rotfloat}
#+LATEX_HEADER_EXTRA: \usepackage{lmodern}
#+LATEX_HEADER: \hypersetup{colorlinks=true, linkcolor=blue}
#+LATEX_HEADER_EXTRA: \usepackage{tabularx}
#+LATEX_HEADER_EXTRA: \usepackage{tabu,longtable}
#+LATEX_HEADER_EXTRA: \usepackage{booktabs}
#+OPTIONS: ^:nil

** Piirilevyn suunnittelu

    #+BEGIN_SRC bash :eval no-export :results output :exports results
    echo SCHEMA_ROOT=$SCHEMA_ROOT
    echo SCHEMA_NAME=$SCHEMA_NAME
    echo RELEASE=$RELEASE
    #+END_SRC

    #+RESULTS:
    : SCHEMA_ROOT=schema
    : SCHEMA_NAME=jrr5
    : RELEASE=E

    #+call:kicad-project()

    #+RESULTS:

    #+call: kicad-schema-pic()

    #+RESULTS:
    [[file:pics/jrr5.pdf]]

*** Painonappien etäisyys näyttöupotuksen reunoista

#+BEGIN_SRC octave :eval no-export :results output :session *Octave* :exports both

  mm = 1;

  pin2edge=8.315;
  edge2button = 22.5;

  hdr_slot_tol = 1+0.5;

  hdr_slot2button =  edge2button + pin2edge  - hdr_slot_tol


  #+END_SRC   

  #+RESULTS:
  : hdr_slot2button = 29.315

** Fab

#+BEGIN_SRC bash :eval no-export :results output
echo "Running in $(pwd) host '$(hostname)' on $(date)"
echo "SCHEMA_ROOT=$SCHEMA_ROOT"
echo "SCHEMA_NAME=$SCHEMA_NAME"
echo "RELEASE=$RELEASE"

#+END_SRC

#+RESULTS:
: Running in /home/jj/work/jrr host 'eero' on ma 7.7.2025 13.41.58 +0300
: SCHEMA_ROOT=schema
: SCHEMA_NAME=jrr5
: RELEASE=E

#+call: kicad-fab()

#+RESULTS:
#+begin_example
Running in /home/jj/work/jrr host 'eero' on ma 7.7.2025 13.53.40 +0300

Creating pdf for pcb layers in SCHEMA_NAME=jrr5

- LAYERS=B.Fab,Edge.Cuts,User.Comments,User.Drawings
- SCHEMA_ROOT=schema ('panels' or 'schema')
- PCB desing PCB_FILE=schema/jrr5/jrr5.kicad_pcb in PCB_DIR=schema/jrr5
- Images in IMAGE_PDF=pics/fab.pdf

Using IMAGE_DIR=
Loading board
Done OK
#+end_example

** Gerbers

#+BEGIN_SRC bash :eval no-export :results output
echo "Running in $(pwd) host '$(hostname)' on $(date)"
echo "SCHEMA_ROOT=$SCHEMA_ROOT"
echo "SCHEMA_NAME=$SCHEMA_NAME"
echo "RELEASE=$RELEASE"

#+END_SRC

#+RESULTS:
: Running in /home/jj/work/jrr host 'eero' on ma 23.6.2025 11.19.44 +0300
: SCHEMA_ROOT=schema
: SCHEMA_NAME=jrr5
: RELEASE=E

#+call: kicad-gerber()

#+RESULTS:
#+begin_example
Running in /home/jj/work/jrr host 'eero' on ma 23.6.2025 11.59.57 +0300

Creating gerber zip file ZIP_FILE=schema/jrr5/jrr5-E.zip for default SCHEMA_NAME=jrr5

- SCHEMA_ROOT=schema ('panels' or 'schema')
- PCB desing PCB_FILE=schema/jrr5/jrr5.kicad_pcb in PCB_DIR=schema/jrr5
- Gerbers in GERBER_DIR=schema/jrr5/gerber
- Zip file ZIP_FILE=schema/jrr5/jrr5-E.zip

Using GERBER_DIR=schema/jrr5/gerber
Loading board
Plotted to 'schema/jrr5/gerber/jrr5-F_Cu.gtl'.
Plotted to 'schema/jrr5/gerber/jrr5-B_Cu.gbl'.
Plotted to 'schema/jrr5/gerber/jrr5-F_Paste.gtp'.
Plotted to 'schema/jrr5/gerber/jrr5-B_Paste.gbp'.
Plotted to 'schema/jrr5/gerber/jrr5-F_Silkscreen.gto'.
Plotted to 'schema/jrr5/gerber/jrr5-B_Silkscreen.gbo'.
Plotted to 'schema/jrr5/gerber/jrr5-F_Mask.gts'.
Plotted to 'schema/jrr5/gerber/jrr5-B_Mask.gbs'.
Plotted to 'schema/jrr5/gerber/jrr5-User_Comments.gbr'.
Plotted to 'schema/jrr5/gerber/jrr5-Edge_Cuts.gm1'.
Loading board
Created file 'schema/jrr5/gerber/jrr5.drl'
Created file 'schema/jrr5/gerber/jrr5-drl_map.pdf'.
Done.
  adding: schema/jrr5/gerber/ (stored 0%)
  adding: schema/jrr5/gerber/jrr5-F_Paste.gtp (deflated 59%)
  adding: schema/jrr5/gerber/jrr5-B_Silkscreen.gbo (deflated 83%)
  adding: schema/jrr5/gerber/jrr5-drl_map.pdf (deflated 12%)
  adding: schema/jrr5/gerber/jrr5-B_Paste.gbp (deflated 65%)
  adding: schema/jrr5/gerber/jrr5-F_Mask.gts (deflated 72%)
  adding: schema/jrr5/gerber/jrr5-F_Cu.gtl (deflated 74%)
  adding: schema/jrr5/gerber/jrr5-B_Cu.gbl (deflated 75%)
  adding: schema/jrr5/gerber/jrr5.drl (deflated 65%)
  adding: schema/jrr5/gerber/jrr5-F_Silkscreen.gto (deflated 83%)
  adding: schema/jrr5/gerber/jrr5-Edge_Cuts.gm1 (deflated 39%)
  adding: schema/jrr5/gerber/jrr5-B_Mask.gbs (deflated 73%)
  adding: schema/jrr5/gerber/jrr5-User_Comments.gbr (deflated 67%)
  adding: schema/jrr5/gerber/jrr5-job.gbrjob (deflated 73%)
Done OK
#+end_example



*** Deploy ~DATA_SHEET_DIR/DOC-RELEASE.pdf~                        :noexport:
  #+BEGIN_SRC bash :eval no-export :results output
  echo RELEASE=$RELEASE
  echo DATA_SHEET_DIR=$DATA_SHEET_DIR
  echo SCHEMA_NAME=$SCHEMA_NAME
  echo DOC=$DOC
  #+END_SRC

  #+RESULTS:
  : RELEASE=D
  : DATA_SHEET_DIR=/home/jj/work/data-sheets/omat
  : SCHEMA_NAME=jrr5
  : DOC=jrr5-pcb


  #+BEGIN_SRC bash :eval no-export :results output
  ls -ltr $DATA_SHEET_DIR/$DOC* ; true
  #+END_SRC

  #+RESULTS:
  : -rw-rw-r-- 1 jj jj 668631 helmi   6 15:00 /home/jj/work/data-sheets/omat/jrr5-pcb-jrr5-A.pdf
  : -rw-rw-r-- 1 jj jj 668631 helmi   6 15:02 /home/jj/work/data-sheets/omat/jrr5-pcb-jrr5-C.pdf
  : -rw-rw-r-- 1 jj jj 634648 helmi  19 10:05 /home/jj/work/data-sheets/omat/jrr5-pcb-jrr5-D.pdf

  Export to pdf
  #+BEGIN_SRC elisp
  (org-latex-export-to-pdf)
  #+END_SRC

  #+RESULTS:
  : /home/jj/work/järviradio-radio/jrr5-pcb.pdf

  Show pdf
  #+BEGIN_SRC bash :eval no-export :results output
  ls -ltr $DOC.pdf
  #+END_SRC

  #+RESULTS:
  : -rw-rw-r-- 1 jj jj 634648 helmi  19 10:05 jrr5-pcb.pdf


  Copy exported pdf as ~${RELEASE}~ -version to ~$DATA_SHEET_DIR~.
  #+BEGIN_SRC bash :eval no-export :results output file
  TARGET=$DATA_SHEET_DIR/${DOC}-${SCHEMA_NAME}-${RELEASE}.pdf
  cp $DOC.pdf $TARGET 
  echo -n $TARGET 
  #+END_SRC

  #+RESULTS:
  [[file:/home/jj/work/data-sheets/omat/jrr5-pcb-jrr5-D.pdf]]

  Datasheets installed into directory: 
  #+BEGIN_SRC bash :eval no-export :results output file :exports results
  echo -n $DATA_SHEET_DIR
  #+END_SRC

  #+RESULTS:
  [[file:/home/jj/work/data-sheets/omat]]

  #+BEGIN_SRC bash :eval no-export :results output
  ls -lt $DATA_SHEET_DIR/${DOC}-*.pdf $DOC.org   $DOC.pdf
  #+END_SRC

  #+RESULTS:
  : -rw-rw-r-- 1 jj jj  11287 helmi   6 15:02 jrr5-pcb.org
  : -rw-rw-r-- 1 jj jj 668631 helmi   6 15:02 /home/jj/work/data-sheets/omat/jrr5-pcb-jrr5-C.pdf
  : -rw-rw-r-- 1 jj jj 668631 helmi   6 15:02 jrr5-pcb.pdf
  : -rw-rw-r-- 1 jj jj 668631 helmi   6 15:00 /home/jj/work/data-sheets/omat/jrr5-pcb-jrr5-A.pdf

    
